The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ChangeUnitsFormatWarn { get; }
  Visual Basic
Public Shared ReadOnly Property ChangeUnitsFormatWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ChangeUnitsFormatWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace